# 3. Вывести на экран числа от -N до N

n = int(input('Введите N\n'))

print(list(range(-n, n + 1)))