# Дана последовательность чисел. 
# Получить список уникальных элементов заданной последовательности.
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

data = [1, 2, 3, 5, 1, 5, 3, 10]

i = 0
while i < len(data):
    j = i+1
    while j < len(data):
        if data[i] == data[j]:
            data = list(filter(lambda x: x != data[i], data))
            i = 0 # Удалили дубликаты и начинаем поиск с начала
            j = i
        j += 1
    i += 1
print(data)